atomic-operations-in-common-lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-29 Fri 15:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Atomic operations in common lisp</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="tufte.css" type="text/css" />
<meta name="description" content="Using clojure atoms in common lisp">
<meta http-equiv="Content-Security-Policy"  content="default-src 'self'; img-src https://*; child-src 'none';">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Atomic operations in common lisp</h1>
<p>
Summary: An example of how to use a clojure style "atom" in common lisp for concurrency control.
</p>

<p>
I was listening to <a href="https://www.manning.com/books/data-oriented-programming">Data-Oriented Programming</a> chapter on "Advanced concurrency control", the book talks
about "Atoms" as an alternative to using mutexes and locking to protect critical sections.  This term
means something different in comon lisp.  I've noticed that a lot of people confuse data oriented design
with data oriented programming, not sure why.
</p>

<p>
In common lisp, an atom single "thing" that is not a cons, the <a href="http://clhs.lisp.se/Body/f_atom.htm">atom</a> function can test what an atom is.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #458588;">(</span>atom nil<span style="color: #458588;">)</span> <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">=&gt; T</span>
<span style="color: #458588;">(</span>atom 'some-symbol<span style="color: #458588;">)</span> <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">=&gt; T</span>
<span style="color: #458588;">(</span>atom 3<span style="color: #458588;">)</span> <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">=&gt; T</span>
<span style="color: #458588;">(</span>atom <span style="color: #b8bb26;">"moo"</span><span style="color: #458588;">)</span> <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">=&gt; T</span>
<span style="color: #458588;">(</span>atom <span style="color: #b16286;">(</span>cons 1 2<span style="color: #b16286;">)</span><span style="color: #458588;">)</span> <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">=&gt; NIL</span>
<span style="color: #458588;">(</span>atom '<span style="color: #b16286;">(</span>1 . 2<span style="color: #b16286;">)</span><span style="color: #458588;">)</span> <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">=&gt; NIL</span>
<span style="color: #458588;">(</span>atom '<span style="color: #b16286;">(</span>1 2 3 4<span style="color: #b16286;">)</span><span style="color: #458588;">)</span> <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">=&gt; NIL</span>
<span style="color: #458588;">(</span>atom <span style="color: #b16286;">(</span>list 1 2 3 4<span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #7c6f64;">;;  </span><span style="color: #7c6f64;">=&gt; NIL</span>
</pre>
</div>

<p>
Unfortunately this is <b>not</b> the same thing as an <a href="https://clojure.org/reference/atoms">atom in the clojure language</a>.  The definition
of an atom according to the docs is "Atoms provide a way to manage shared, synchronous,
independent state. They are a reference type like refs and vars.
</p>

<p>
Not being a clojure programmer, I had to look up what that meant, its a funky way of saying
that is is thread-safe way to update a variable.  It continues to apply a pure function with
the 'value to be swapped' as an arguement, and if there are no changes to the variable to be
swapped, it the value is changed atomicly.
</p>

<p>
Unlike Clojure, there is no cross-implementation "native" method we can use ensure an atomic
swap of any lisp variable by portably by using the <a href="https://github.com/Shinmera/atomics">atomics</a> library.  In some languages this is known
as "CAS" or "Compare and swap".
</p>

<p>
The <b>atomics:atomic-update</b> function wraps many common-lisp implementations atomic operations.
</p>

<p>
The atomics:atomic-update function definition is:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defmacro</span> <span style="color: #fabd2f;">atomic-update</span> <span style="color: #b16286;">(</span>place update-fn<span style="color: #b16286;">)</span> ....
</pre>
</div>

<p>
The SBCL specific implementation that the atomic-update wraps is also named "atomic-update" shown
here:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #458588;">(</span>sb-xc:defmacro atomic-update <span style="color: #b16286;">(</span>place update-fn <span style="color: #d3869b;">&amp;rest</span> arguments <span style="color: #d3869b;">&amp;environment</span> env<span style="color: #b16286;">)</span>
  ....
</pre>
</div>

<p>
The documentation for this function describes the arguments:
</p>

<div class="org-src-container">
<pre class="src src-english">Updates PLACE atomically to the value returned by calling function
designated by UPDATE-FN with ARGUMENTS and the previous value of PLACE.

PLACE may be read and UPDATE-FN evaluated and called multiple times before the
update succeeds: atomicity in this context means that the value of PLACE did
not change between the time it was read, and the time it was replaced with the
computed value.

PLACE can be any place supported by *SB-EXT:COMPARE-AND-SWAP*.
</pre>
</div>

<p>
For your convience, I'll get the documentation about the "supported places" in the
<b>SB-EXT:COMPARE-AND-SWAP</b> macro.
</p>

<div class="org-src-container">
<pre class="src src-english">Atomically stores NEW in PLACE if OLD matches the current value of PLACE.

Two values are considered to match if they are EQ. Returns the previous value
of PLACE: if the returned value is EQ to OLD, the swap was carried out.

PLACE must be an CAS-able place. Built-in CAS-able places are accessor forms
whose CAR is one of the following:

 CAR, CDR, FIRST, REST, SVREF, SYMBOL-PLIST, SYMBOL-VALUE, SVREF, SLOT-VALUE
 SB-MOP:STANDARD-INSTANCE-ACCESS, SB-MOP:FUNCALLABLE-STANDARD-INSTANCE-ACCESS,

or the name of a DEFSTRUCT created accessor for a slot whose storage type
is not raw. (Refer to the the "Efficiency" chapter of the manual
for the list of raw slot types.  Future extensions to this macro may allow
it to work on some raw slot types.)
</pre>
</div>

<p>
This documention was confusing for me.  I think what they meant to say is.
</p>

<div class="org-src-container">
<pre class="src src-english">PLACE must be an CAS-able place. Built-in CAS-able places *have* accessor forms
whose CAR is one of the following:
</pre>
</div>

<div id="outline-container-orgf346b7b" class="outline-2">
<h2 id="orgf346b7b">Non threaded example</h2>
<div class="outline-text-2" id="text-orgf346b7b">
<p>
Putting that knowledge into work, we can start by making a single-threaded / single process
demonstration that mutates the list in place.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #458588;">(</span><span style="color: #fb4933;">defparameter</span> <span style="color: #83a598;">cas-able-place</span> '<span style="color: #b16286;">(</span>1 2 3 4 <span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">a-pure-function</span> <span style="color: #b16286;">(</span>a<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>rest a<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">process</span> <span style="color: #b16286;">()</span>
      <span style="color: #b16286;">(</span>atomics:atomic-update cas-able-place 'a-pure-function<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

</pre>
</div>

<p>
The variable "cas-able-place" is a list and  the 'car' function can be used to iterate through
elements of the list. This means it meets the CAS requirements for an place.
</p>

<p>
So now every time we run 'process' function, the value of cas-able-place should have
one less item, lets test:
</p>

<div class="org-src-container">
<pre class="src src-lisp">CL-USER&gt; cas-able-place
<span style="color: #458588;">(</span>CAR 1 2 3 4<span style="color: #458588;">)</span>
CL-USER&gt; <span style="color: #458588;">(</span>process<span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>1 2 3 4<span style="color: #458588;">)</span>
CL-USER&gt; <span style="color: #458588;">(</span>process<span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>2 3 4<span style="color: #458588;">)</span>
CL-USER&gt; <span style="color: #458588;">(</span>process<span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>3 4<span style="color: #458588;">)</span>
CL-USER&gt; <span style="color: #458588;">(</span>process<span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>4<span style="color: #458588;">)</span>
CL-USER&gt; <span style="color: #458588;">(</span>process<span style="color: #458588;">)</span>
NIL
</pre>
</div>

<p>
As we expected, The (process) call makes a modification to the cas-able-place list, and the
returned value of <b>a-pure-function</b> also produces cas-valid objects.
</p>

<p>
As stated in the sbcl docs, it important that the function call to update the issue is pure as when
contending it may be run many times.
</p>
</div>
</div>

<div id="outline-container-orge24a1dc" class="outline-2">
<h2 id="orge24a1dc">Multi-threaded example.</h2>
<div class="outline-text-2" id="text-orge24a1dc">
<p>
Lets now make a multi-threaded example,  We're going to cheat a little and create a harmless side effect
of printing to the screen so that we can visualize each time the pure function is run.
</p>

<p>
We'll use these libraries available in quicklisp:
</p>

<p>
The <a href="https://github.com/Shinmera/atomics">Atomics</a> library has a portable method of compare-and-swap.
The <a href="https://github.com/sionescu/bordeaux-threads">bordeaux-threads</a> library is the accepted multi-threading library for common-lisp.
The <a href="https://alexandria.common-lisp.dev/draft/alexandria.html">Alexandria</a> library, has a cheap and easy method to create a list of numbers
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #458588;">(</span>ql:quickload <span style="color: #b8bb26;">"atomics"</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>ql:quickload <span style="color: #b8bb26;">"bordeaux-threads"</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>ql:quickload <span style="color: #b8bb26;">"alexandria"</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>ql:quickload <span style="color: #b8bb26;">"arrows"</span><span style="color: #458588;">)</span>
</pre>
</div>

<p>
We're going to make a simple variable named 'original-list' which we will update atomically, see
the example below, its just a normal lisp list.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defparameter</span> <span style="color: #83a598;">original-list</span> <span style="color: #b16286;">(</span>alexandria:iota 100 <span style="color: #fe8019;">:start</span> 0 <span style="color: #fe8019;">:step</span> 1<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
<p>
(0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28
 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54
 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80
 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99)
</p>


<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #7c6f64;">;</span><span style="color: #7c6f64;">same function as earlier.</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">a-pure-function</span> <span style="color: #b16286;">(</span>a<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>format t <span style="color: #b8bb26;">"."</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>finish-output<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>rest a<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">demo-race-condition-locks</span> <span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">dotimes</span> <span style="color: #8ec07c;">(</span>n 5<span style="color: #8ec07c;">)</span>
  <span style="color: #8ec07c;">(</span>bt2:make-thread <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">lambda</span> <span style="color: #458588;">()</span>
                    <span style="color: #458588;">(</span><span style="color: #fb4933;">dotimes</span> <span style="color: #b16286;">(</span>n 20<span style="color: #b16286;">)</span>
                      <span style="color: #b16286;">(</span>atomics:atomic-update original-list 'a-pure-function<span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
                      <span style="color: #458588;">)</span>
</pre>
</div>
<p>
CL-USER&gt; (demo-race-condition-locks)
&#x2026;..
NIL
&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;.
</p>

<p>
However, we can see that there are 114 dots, which means that 5 threads there were 14 times that the
locking function was contending for the original value.
</p>

<p>
This however, doesn't prove that the readers were all looking at the value in a 'safe state', so lets
lets try that.  We'll only take 50 out of 100 valuesof the list, if there were two readers taking access to the original list
at the same time, there would not be exactly 50 values left.  For completeness, we will run the test 1000 times
just to assist in triggering some kind of problem.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">a-pure-function</span> <span style="color: #b16286;">(</span>a<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>rest a<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">take-only-50</span> <span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">loop</span> for i from 1 to 5
        collect <span style="color: #8ec07c;">(</span>bt2:make-thread
                 <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">lambda</span> <span style="color: #458588;">()</span>
                   <span style="color: #458588;">(</span><span style="color: #fb4933;">dotimes</span> <span style="color: #b16286;">(</span>n 10<span style="color: #b16286;">)</span>
                     <span style="color: #b16286;">(</span>atomics:atomic-update original-list 'a-pure-function<span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">trigger</span> <span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span>format t <span style="color: #b8bb26;">"Testing:"</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">dotimes</span> <span style="color: #8ec07c;">(</span>n 1000<span style="color: #8ec07c;">)</span>
    <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">progn</span>
      <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">defparameter</span> <span style="color: #83a598;">original-list</span> <span style="color: #458588;">(</span>alexandria:iota 100 <span style="color: #fe8019;">:start</span> 0 <span style="color: #fe8019;">:step</span> 1<span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
      <span style="color: #d65d0e;">(</span>mapcar <span style="color: #458588;">(</span><span style="color: #fb4933;">lambda</span> <span style="color: #b16286;">(</span>thread<span style="color: #b16286;">)</span> <span style="color: #b16286;">(</span>bt2:join-thread thread<span style="color: #b16286;">)</span><span style="color: #458588;">)</span> <span style="color: #458588;">(</span>take-only-50<span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
      <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">if</span> <span style="color: #d65d0e;">(</span>= 50 <span style="color: #458588;">(</span>length original-list<span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
          <span style="color: #d65d0e;">(</span>format t <span style="color: #b8bb26;">"&#10003;"</span><span style="color: #d65d0e;">)</span>
          <span style="color: #d65d0e;">(</span>format t <span style="color: #b8bb26;">"&#10060;"</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #fdf4c1;">)</span>
</pre>
</div>

<p>
This program creates 5 threads, each will take 10 values from the list.  Meaning that at
the end there should be 50 values left.  If there is  exactly 50 items left at the end
of each run a tick will be printed, if anything else, a cross will be printed.
</p>

<p>
A demo run of this creates this output:
</p>

<div class="org-src-container">
<pre class="src src-english">CL-USER&gt; (trigger)
Testing:✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓✓
NIL
</pre>
</div>

<p>
I'll update this post if I find any more information, but I'm pleasently surprised with how easy this was.
</p>
</div>
</div>



<div id="outline-container-org19c4bdc" class="outline-2">
<h2 id="org19c4bdc">Resources:</h2>
</div>
</div>
</body>
</html>
